define(function (require, exports) {

	exports.mockAction5 = {
        "ACTION": "5",
        "ERRORNO": "0",
        "TIME": "2024-12-02 13:30:50"
    }

    

    exports.mocktoday = {
        "ZZPINDEX": "9|4,10|0",
        "BUSINESSNAMEINDEX": "6",
        "OPTIONCODEINDEX": "2",
        "STARTPOS": "1",
        "BUSINESSTYPEINDEX": "7",
        "NEWINDEX": "1",
        "ERRORNO": "0",
        "MATCHTIMEINDEX": "11",
        "ACTION": "5413",
        "BUYDIRECTIONINDEX": "5",
        "IPHONEKEY": "1733151064307",
        "RECVTYPE": "4",
        "DATEFORMINDEX": "11|hh:mm:ss,0|yyyy-mm-dd",
        "MAXCOUNT": "0",
        "DEALMONEYINDEX": "12",
        "OPTIONNAMEINDEX": "3",
        "STOCKCODEINDEX": "4",
        "REQNO": "373",
        "MATCHPRICEINDEX": "9",
        "COVEREDFLAGINDEX": "8",
        "TOKEN": "Sh1u1Z2270@170A-1E79502TaSJQp",
        "TZTUSEDTIME": "82",
        "INTACTTOSERVER": "@ClZvbHVtZUluZm8JAAAAMTcwQS0xRTc5",
        "GRID0": [
            "交易日期|流水序号|期权合约编码|合约名称|证券代码|买卖方向|开平仓方向|业务名称|备兑标志|成交价格|成交数量|成交时间|成交金额|",
        ],
        "MATCHQTYINDEX": "10"
    }
    
    exports.mockHistory = {
        "ZZPINDEX": "11|4,13|0",
        "BUSINESSNAMEINDEX": "18",
        "OPTIONCODEINDEX": "3",
        "STARTPOS": "21",
        "NEWINDEX": "1",
        "ERRORNO": "339801",
        "WTACCOUNTTYPENAMEINDEX": "2",
        "ACTION": "5424",
        "BUYDIRECTIONINDEX": "7",
        "OPTIONTYPEINDEX": "6",
        "IPHONEKEY": "1733151101542",
        "RECVTYPE": "4",
        "DATEFORMINDEX": "0|yyyy-mm-dd,1|hh:mm:ss",
        "MAXCOUNT": "338",
        "DEALMONEYINDEX": "12",
        "OPTIONNAMEINDEX": "4",
        "STOCKCODEINDEX": "5",
        "REQNO": "374",
        "MATCHPRICEINDEX": "11",
        "COVEREDFLAGINDEX": "9",
        "TOKEN": "Sh1u1Z2270@170A-1E79502TaSJQp",
        "MATCHDATEINDEX": "0",
        "TZTUSEDTIME": "1450",
        "INTACTTOSERVER": "@ClZvbHVtZUluZm8JAAAAMTcwQS0xRTc5",
        "GRID0": [
            "发生日期|成交时间|市场类型|期权合约编码|合约名称|证券代码|持仓类型|买卖方向|开平仓方向|备兑标志|业务状态|成交价格|成交金额|发生数量|后证券额|佣金|印花税|过户费|业务名称|",
            "20241114|92510|沪A|10007923|科创50购11月900|588000|义务方|卖出|开仓| |成交|0.208200|2082.00|1.00|1.00|0.00|0.00|0.00|卖出开仓|",
            "20241114|143352|沪A|10007871|50ETF沽11月2350|510050|义务方|卖出|开仓| |成交|0.000400|4.00|1.00|1.00|0.00|0.00|0.00|卖出开仓|",
            "20241114|143446|沪A|10007871|50ETF沽11月2350|510050|义务方|买入|平仓| |成交|0.000500|5.00|1.00|0.00|5.00|0.00|0.00|买入平仓|",
            "20241114|230001|沪A|10007923|科创50购11月900|588000|权利方|卖出|平仓| |成交|0.000000|0.00|1.00|0.00|0.00|0.00|0.00|期权仓位对冲|",
            "20241114|230002|沪A|10007923|科创50购11月900|588000|义务方|买入|平仓| |成交|0.000000|0.00|1.00|0.00|0.00|0.00|0.00|期权仓位对冲|",
            "20241115|103015|沪A|10007871|50ETF沽11月2350|510050|义务方|卖出|开仓| |成交|0.000400|4.00|1.00|1.00|0.00|0.00|0.00|卖出开仓|",
            "20241115|103105|沪A|10007871|50ETF沽11月2350|510050|义务方|买入|平仓| |成交|0.000500|5.00|1.00|0.00|5.00|0.00|0.00|买入平仓|",
            "20241115|103209|沪A|10007871|50ETF沽11月2350|510050|权利方|买入|开仓| |成交|0.000500|5.00|1.00|1.00|5.00|0.00|0.00|买入开仓|",
            "20241115|103301|沪A|10007871|50ETF沽11月2350|510050|权利方|买入|开仓| |成交|0.000500|10.00|2.00|3.00|10.00|0.00|0.00|买入开仓|",
            "20241115|103622|沪A|10007871|50ETF沽11月2350|510050|权利方|买入|开仓| |成交|0.000500|10.00|2.00|5.00|10.00|0.00|0.00|买入开仓|",
            "20241115|103852|沪A|10007871|50ETF沽11月2350|510050|义务方|卖出|开仓| |成交|0.000400|4.00|1.00|1.00|0.00|0.00|0.00|卖出开仓|",
            "20241115|104026|沪A|10007871|50ETF沽11月2350|510050|义务方|卖出|开仓| |成交|0.000400|4.00|1.00|2.00|0.00|0.00|0.00|卖出开仓|",
            "20241115|104515|沪A|10007904|500ETF购11月5250|510500|权利方|买入|开仓| |成交|0.879500|8795.00|1.00|1.00|5.00|0.00|0.00|买入开仓|",
            "20241115|104727|沪A|10007871|50ETF沽11月2350|510050|权利方|买入|开仓| |成交|0.000500|5.00|1.00|6.00|5.00|0.00|0.00|买入开仓|",
            "20241115|104820|沪A|10007871|50ETF沽11月2350|510050|权利方|买入|开仓| |成交|0.000500|10.00|2.00|8.00|10.00|0.00|0.00|买入开仓|",
            "20241115|104921|沪A|10007871|50ETF沽11月2350|510050|权利方|卖出|平仓| |成交|0.000400|4.00|1.00|7.00|4.00|0.00|0.00|卖出平仓|",
            "20241115|105355|沪A|10007871|50ETF沽11月2350|510050|权利方|卖出|平仓| |成交|0.000400|4.00|1.00|6.00|4.00|0.00|0.00|卖出平仓|",
            "20241115|105450|沪A|10007871|50ETF沽11月2350|510050|权利方|卖出|平仓| |成交|0.000400|8.00|2.00|4.00|8.00|0.00|0.00|卖出平仓|",
            "20241115|105655|沪A|10007871|50ETF沽11月2350|510050|义务方|卖出|开仓| |成交|0.000400|4.00|1.00|3.00|0.00|0.00|0.00|卖出开仓|",
            "20241115|105724|沪A|10007871|50ETF沽11月2350|510050|权利方|卖出|平仓| |成交|0.000400|4.00|1.00|3.00|4.00|0.00|0.00|卖出平仓|"
        ],
        "MATCHQTYINDEX": "13"
    }

});
